In [9]:
# Panel Data Series
#!pip3 install pandas

In [11]:
import pandas as pd

In [67]:
df = pd.DataFrame([
    ['a' + str(i) for i in range(100)],
    [i for i in range(100)],
    ['b' + str(i) for i in range(100)]
])
df = df.T
df

      0   1    2
0    a0   0   b0
1    a1   1   b1
2    a2   2   b2
3    a3   3   b3
4    a4   4   b4
..  ...  ..  ...
95  a95  95  b95
96  a96  96  b96
97  a97  97  b97
98  a98  98  b98
99  a99  99  b99

[100 rows x 3 columns]

In [26]:
df = pd.DataFrame({
    'char1': ['a' + str(i) for i in range(100)],
    'numbers': [i for i in range(100)],
    'char2': ['b' + str(i) for i in range(100)]
})
df

   char1  numbers char2
0     a0        0    b0
1     a1        1    b1
2     a2        2    b2
3     a3        3    b3
4     a4        4    b4
..   ...      ...   ...
95   a95       95   b95
96   a96       96   b96
97   a97       97   b97
98   a98       98   b98
99   a99       99   b99

[100 rows x 3 columns]

In [29]:
df['char2']

0      b0
1      b1
2      b2
3      b3
4      b4
     ...
95    b95
96    b96
97    b97
98    b98
99    b99
Name: char2, Length: 100, dtype: object

In [32]:
type(df['char2'])

pandas.core.series.Series

In [36]:
type(df[['numbers']])

pandas.core.frame.DataFrame

In [38]:
df['char2'][6]

'b6'

In [40]:
df.loc[6, 'char2']

'b6'

In [44]:
df.loc[6:12:2, ['char2', 'numbers']]

   char2  numbers
6     b6        6
8     b8        8
10   b10       10
12   b12       12

In [50]:
df.iloc[6:12:2, 1]

6      6
8      8
10    10
Name: numbers, dtype: int64

In [52]:
df.iloc[6:12:2, 1] = 'test'
df.iloc[6:12:2, 1]

6     test
8     test
10    test
Name: numbers, dtype: object

In [56]:
df.query('numbers == "test"')

   char1 numbers char2
6     a6    test    b6
8     a8    test    b8
10   a10    test   b10

In [58]:
df.loc[df.numbers == "test"]

   char1 numbers char2
6     a6    test    b6
8     a8    test    b8
10   a10    test   b10

In [64]:
df['char2']
df.char2.apply(lambda x: x + '_course')

0      b0_course
1      b1_course
2      b2_course
3      b3_course
4      b4_course
         ...
95    b95_course
96    b96_course
97    b97_course
98    b98_course
99    b99_course
Name: char2, Length: 100, dtype: object

In [65]:
df.char2 + '_course'

0      b0_course
1      b1_course
2      b2_course
3      b3_course
4      b4_course
         ...
95    b95_course
96    b96_course
97    b97_course
98    b98_course
99    b99_course
Name: char2, Length: 100, dtype: object